greetings = [
  "Привет, мой маленький любитель мистики. Отвечаю на твой вопрос...",
  "Вопрошающий да услышит:",
  "Я видел такое, что вам, людям, и не снилось... Впрочем, неважно. Вот твой ответ:"
] 

answers = [
  # Положительные:
  "Бесспорно",
  "Предрешено",
  "Никаких сомнений",
  "Определённо да",
  "Можешь быть уверен в этом",

  # Нерешительно положительные
  "Мне кажется — «да»",
  "Вероятнее всего",
  "Хорошие перспективы",
  "Знаки говорят — «да»",
  "Да",

  # Нейтральные
  "Пока не ясно, попробуй снова",
  "Спроси позже",
  "Лучше не рассказывать",
  "Сейчас нельзя предсказать",
  "Сконцентрируйся и спроси опять",

  # Отрицательные
  "Даже не думай",
  "Мой ответ — «нет»",
  "По моим данным — «нет»",
  "Перспективы не очень хорошие",
  "Весьма сомнительно"
]

puts greetings.sample

puts

sleep 3 

puts answers.sample